{
  "commentaryList": [
    {
      "commText": "B0$ \\n \\nHeading into their respective last games of the season, it's a must-win scenario for both Punjab Kings and Mumbai Indians to secure a place in Qualifier 1. And to settle matters, they meet at a neutral ground, the benign surface of the Sawai Mansingh Stadium in Jaipur, now the adopted home of the Shreyas Iyer-led side. \\n \\nAt a venue where pitches have historically been slow and massive scores have been challenging to attain, the template has been different this season with teams batting first having an average score of 200-plus. Punjab Kings have taken little time to warm up to the conditions. Combining the depth and explosiveness, they have breached that mark in their last two outings at the venue, and even with the loss against Delhi Capitals less than 48 hours earlier, they would be well placed to have gotten accustomed to the demands of the conditions ahead of the all-important clash. \\n \\nPunjab Kings and Mumbai Indians meet at a time when both can stake a claim to be among the most well-rounded units in the competition. So can the two other teams, Gujarat Titans and Royal Challengers Bengaluru, who are part of a four-way battle at the top. So little is the difference. And hence, a loss can be quite off-putting, not only for losing the momentum ahead of the playoffs but also having to take the Eliminator route in pursuit of the title. \\n \\nThere is no dearth of quality and depth on either side, yet one aspect of their game is bound to offer greater excitement- the death overplay. Punjab Kings, with their batting depth likely to feature Marco Jansen at No. 9, have scored at a pace of 11.68 in the death overs this season, more than any other team. In the same phase, MI's bowling attack has also been extremely productive, having picked up most wickets and been the second-most stingiest in this phase. \\n \\nThere's more than just the batting muscle and bowling firepower that separates the two teams. The ability to handle pressure. For Mumbai Indians, a team that retained its core, it's about going through the motions they have been through a few times in the past. On the contrary, for Punjab Kings, a team that has pressed the refresh button in order to refresh their hopes, it's a fairly new territory, one that they haven't entered too often. But free of their past baggage, it remains to be seen if the new group can press ahead in the crucial encounter in their bid to achieve what has eluded them for 18 summers. \\n \\nB1$ Monday, May 25, 2025, 7:30 PM IST \\n \\nB2$ Punjab Kings vs Mumbai Indians, Sawai Mansingh Stadium, Jaipur \\n \\nB3$ Contrary to the slow and sluggish pitches in previous seasons, run-scoring has been relatively more straightforward this season. The average score batting first this season is approximately 201, with the 200-run mark breached four times in six games. Both Punjab Kings and Mumbai Indians have done that. With limited assistance for bowlers, it should pave the way for another high-scoring encounter. \\n \\nB4$ Mumbai Indians have had a marginal edge over Punjab Kings, with a 17-15 win-loss record. However, both teams have won five games each since 2019. \\n \\nB5$ \\n \\nB6$ \\n \\nB7$ Yuzvendra Chahal sat out of the previous game. His availability remains uncertain. \\n \\nB8$ Yuzvendra Chahal has dismissed Hardik Pandya four times in the IPL and conceded only 71 runs in a 74-ball face-off against the big-hitter. If Chahal is available for the contest, expect some responsibility in the latter half of MI's innings \\n \\nB9$ Prabhsimran Singh (wk), Priyansh Arya, Josh Inglis, Shreyas Iyer, Nehal Wadhera, Shashank Singh, Marcus Stoinis, Azmatullah Omarzai, Marco Jansen, Harpreet Brar, Arshdeep Singh, Yuzvendra Chahal/Praveen Dubey \\n \\nB10$ \\n \\nB7$ There are no reported injuries or unavailability. \\n \\nB8$ The in-form Shreyas Iyer will be a critical target. He has had a fair bit of success against MI's pace trio of Jasprit Bumrah, Trent Boult and Deepak Chahar in the IPL averaging 87 against them. \\n \\nB9$ Rohit Sharma, Ryan Rickleton, Will Jacks, Suryakumar Yadav, Tilak Varma, Hardik Pandya, Naman Dhir, Mitchell Santner, Deepak Chahar, Karn Sharma, Trent Boult, Jasprit Bumrah \\n \\nB14$ \\n \\n- The catching efficiency at the Sawai Mansingh Stadium, Jaipur in IPL 2025 has been 60%, the lowest among all venues, with 28 dropped catches (the most). \\n \\n- Punjab Kings' average first innings score this season has been 204. They have also racked up the joint-most (7) 200-plus total by any team in a single T20 competition. \\n \\n- Mumbai Indians have bagged the most wickets in the death overs (33), and boast of the best average (15.48), strike rate (9.6) and lowest boundary percentage (19.49%). Their economy rate of 9.64 in this period is only bettered by KKR (9.24).",
      "timestamp": 1748185168360,
      "ballNbr": 0,
      "event": "NONE",
      "batTeamName": "",
      "commentaryFormats": {
        "bold": {
          "formatId": [
            "B0$",
            "B1$",
            "B2$",
            "B3$",
            "B4$",
            "B5$",
            "B6$",
            "B7$",
            "B8$",
            "B9$",
            "B10$",
            "B11$",
            "B12$",
            "B13$",
            "B14$"
          ],
          "formatValue": [
            "Preview",
            "When:",
            "Where:",
            "What to expect:",
            "Head-to-head:",
            "Team Watch:",
            "Punjab Kings",
            "Injuries/Unavailability:",
            "Tactics & Matchups:",
            "Probable XII:",
            "Mumbai Indians:",
            "Injuries/Unavailability:",
            "Tactics & Matchups:",
            "Probable XII:",
            "Did you know:"
          ]
        }
      }
    },
    {
      "commText": "B0$",
      "timestamp": 1748185168350,
      "ballNbr": 0,
      "event": "NONE",
      "batTeamName": "",
      "commentaryFormats": {
        "bold": {
          "formatId": [
            "B0$"
          ],
          "formatValue": [
            "Squads:"
          ]
        }
      }
    },
    {
      "commText": "B0$ Squad: Priyansh Arya, Prabhsimran Singh, Josh Inglis(w), Shreyas Iyer(c), Nehal Wadhera, Shashank Singh, Marcus Stoinis, Azmatullah Omarzai, Marco Jansen, Harpreet Brar, Arshdeep Singh, Praveen Dubey, Suryansh Shedge, Vijaykumar Vyshak, Xavier Bartlett, Kyle Jamieson, Yuzvendra Chahal, Vishnu Vinod, Yash Thakur, Aaron Hardie, Kuldeep Sen, Mitchell Owen, Harnoor Singh, Musheer Khan, Pyla Avinash",
      "timestamp": 1748185166683,
      "ballNbr": 0,
      "event": "NONE",
      "batTeamName": "",
      "commentaryFormats": {
        "bold": {
          "formatId": [
            "B0$"
          ],
          "formatValue": [
            "Punjab Kings"
          ]
        }
      }
    },
    {
      "commText": "B0$ Squad: Ryan Rickelton(w), Rohit Sharma, Will Jacks, Suryakumar Yadav, Tilak Varma, Hardik Pandya(c), Naman Dhir, Mitchell Santner, Deepak Chahar, Trent Boult, Jasprit Bumrah, Karn Sharma, Ashwani Kumar, Corbin Bosch, Raj Bawa, Satyanarayana Raju, Reece Topley, Mujeeb Ur Rahman, Krishnan Shrijith, Raghu Sharma, Arjun Tendulkar, Robin Minz, Bevon Jacobs",
      "timestamp": 1748185015218,
      "ballNbr": 0,
      "event": "NONE",
      "batTeamName": "",
      "commentaryFormats": {
        "bold": {
          "formatId": [
            "B0$"
          ],
          "formatValue": [
            "Mumbai Indians"
          ]
        }
      }
    }
  ],
  "matchHeader": {
    "matchId": 118892,
    "matchDescription": "69th Match",
    "matchFormat": "T20",
    "matchType": "league",
    "complete": false,
    "domestic": false,
    "matchStartTimestamp": 1748268000000,
    "matchCompleteTimestamp": 1748278800000,
    "dayNight": false,
    "year": 2025,
    "state": "Preview",
    "status": "Match starts at May 26, 14:00 GMT",
    "tossResults": {
      "tossWinnerName": "",
      "decision": ""
    },
    "result": {
      "winningTeam": "",
      "winByRuns": false,
      "winByInnings": false
    },
    "revisedTarget": {
      "reason": ""
    },
    "playersOfTheMatch": [],
    "playersOfTheSeries": [],
    "isMatchNotCovered": false,
    "team1": {
      "id": 65,
      "name": "Punjab Kings",
      "playerDetails": [],
      "shortName": "PBKS"
    },
    "team2": {
      "id": 62,
      "name": "Mumbai Indians",
      "playerDetails": [],
      "shortName": "MI"
    },
    "seriesDesc": "Indian Premier League 2025",
    "seriesId": 9237,
    "seriesName": "Indian Premier League 2025",
    "alertType": "auto",
    "livestreamEnabled": false
  },
  "miniscore": {
    "inningsId": 0,
    "batsmanStriker": {
      "batBalls": 0,
      "batFours": 0,
      "batId": 0,
      "batName": "",
      "batRuns": 0,
      "batSixes": 0,
      "batStrikeRate": 0
    },
    "batsmanNonStriker": {
      "batBalls": 0,
      "batFours": 0,
      "batId": 0,
      "batName": "",
      "batRuns": 0,
      "batSixes": 0,
      "batStrikeRate": 0
    },
    "batTeam": {
      "teamId": 0,
      "teamScore": 0,
      "teamWkts": 0
    },
    "bowlerStriker": {
      "bowlId": 0,
      "bowlName": "",
      "bowlMaidens": 0,
      "bowlNoballs": 0,
      "bowlOvs": 0,
      "bowlRuns": 0,
      "bowlWides": 0,
      "bowlWkts": 0,
      "bowlEcon": 0
    },
    "bowlerNonStriker": {},
    "overs": 0,
    "recentOvsStats": "",
    "partnerShip": {
      "balls": 0,
      "runs": 0
    },
    "matchScoreDetails": {
      "matchId": 118892,
      "inningsScoreList": [],
      "tossResults": {
        "tossWinnerName": "",
        "decision": ""
      },
      "matchTeamInfo": [],
      "isMatchNotCovered": false,
      "matchFormat": "T20",
      "state": "Preview",
      "customStatus": "Match starts at May 26, 14:00 GMT",
      "highlightedTeamId": 0
    },
    "latestPerformance": [],
    "ppData": {},
    "overSummaryList": [],
    "status": "",
    "responseLastUpdated": 1748230131,
    "event": "NONE"
  },
  "commentarySnippetList": [],
  "page": "commentary",
  "enableNoContent": false,
  "matchVideos": [],
  "responseLastUpdated": 1748230131,
  "cb11": {
    "team1Sname": "PBKS",
    "team2Sname": "MI",
    "title": "Play for FREE and Win Rs 2 Crore+",
    "imageId": 0,
    "appLink": "cricbuzz://browser?page=https://play.google.com/store/apps/details?id=in.tricket.tricketApp",
    "webLink": "",
    "isCb11Enabled": true
  },
  "buzz": {
    "imageIds": [
      706409,
      703770,
      703762
    ],
    "position": 2,
    "appLink": "cricbuzz://buzz",
    "isBuzzEnabled": true
  }
}